{
  "architectures": [
    "DeepseekForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_deepseek.DeepseekConfig",
    "AutoModel": "modeling_deepseek.DeepseekModel",
    "AutoModelForCausalLM": "modeling_deepseek.DeepseekForCausalLM"
  },
  "bos_token_id": 100000,
  "eos_token_id": 100001,
  "first_k_dense_replace": 0,
  "hidden_act": "silu",
  "hidden_size": 1280,
  "initializer_range": 0.02,
  "intermediate_size": 6944,
  "max_position_embeddings": 2048,
  "model_type": "deepseek",
  "moe_intermediate_size": 896,
  "moe_layer_freq": 1,
  "n_routed_experts": 63,
  "n_shared_experts": 1,
  "norm_topk_prob": false,
  "num_attention_heads": 10,
  "num_experts_per_tok": 7,
  "num_hidden_layers": 1,
  "num_key_value_heads": 10,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000,
  "scoring_func": "softmax",
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.0",
  "use_cache": true,
  "vocab_size": 102400
}
